[
  {
    "id": "2-47",
    "chapter": 2,
    "verse": 47,
    "sanskrit": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
    "english": "You have a right to perform your duty, but not to the fruits thereof. Never consider yourself the cause of results, nor be attached to inaction.",
    "tags": ["Action", "Karma Yoga", "Work", "Anxiety", "Career"],
    "reflection": "Worried about your job outcome? Focus on what you control. Effort is yours. Outcome isn't. This verse reminds us that our power lies in action, not in controlling results. Do your best, and let the universe handle the rest."
  },
  {
    "id": "2-14",
    "chapter": 2,
    "verse": 14,
    "sanskrit": "मात्रास्पर्शास्तु कौन्तेय शीतोष्णसुखदुःखदाः। आगमापायिनोऽनित्यास्तांस्तितिक्षस्व भारत॥",
    "english": "The contact between the senses and their objects gives rise to feelings of heat and cold, pleasure and pain. They are transient, arising and disappearing. Bear them patiently.",
    "tags": ["Patience", "Emotions", "Mindfulness", "Anxiety", "Self-doubt"],
    "reflection": "Feeling overwhelmed by emotions? Remember: every feeling is temporary. Like seasons, they come and go. Your job isn't to fight them but to observe them pass. This too shall pass."
  },
  {
    "id": "2-62",
    "chapter": 2,
    "verse": 62,
    "sanskrit": "ध्यायतो विषयान्पुंसः सङ्गस्तेषूपजायते। सङ्गात्सञ्जायते कामः कामात्क्रोधोऽभिजायते॥",
    "english": "When one dwells on sense objects, attachment arises. From attachment comes desire, and from desire arises anger.",
    "tags": ["Desire", "Attachment", "Relationships", "Self-control", "Mindfulness"],
    "reflection": "Caught in a cycle of wanting? The mind has a tendency to obsess over what it cannot have. Break the chain by catching yourself at the first link: observation without attachment."
  },
  {
    "id": "3-21",
    "chapter": 3,
    "verse": 21,
    "sanskrit": "यद्यदाचरति श्रेष्ठस्तत्तदेवेतरो जनः। स यत्प्रमाणं कुरुते लोकस्तदनुवर्तते॥",
    "english": "Whatever a great person does, others follow. Whatever standards they set, the world pursues.",
    "tags": ["Leadership", "Career", "Responsibility", "Influence", "Work"],
    "reflection": "Your actions matter more than you think. Whether you're leading a team or raising a child, people watch what you do, not what you say. Lead by example; integrity speaks louder than words."
  },
  {
    "id": "4-7",
    "chapter": 4,
    "verse": 7,
    "sanskrit": "यदा यदा हि धर्मस्य ग्लानिर्भवति भारत। अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्॥",
    "english": "Whenever there is decline in righteousness and rise of unrighteousness, I manifest Myself.",
    "tags": ["Faith", "Hope", "Purpose", "Spirituality", "Difficult Times"],
    "reflection": "In your darkest hour, when all seems lost, know this: balance always returns. The universe has a way of correcting itself. Your struggle is part of a larger restoration. Hold on."
  },
  {
    "id": "6-5",
    "chapter": 6,
    "verse": 5,
    "sanskrit": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्। आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः॥",
    "english": "Elevate yourself by your own self; do not degrade yourself. The self alone is your friend, and the self alone is your enemy.",
    "tags": ["Self-improvement", "Self-doubt", "Mental Health", "Motivation", "Personal Growth"],
    "reflection": "You are your own rescuer. No one else can lift you up if you choose to stay down. But also remember: you can be your worst critic. Choose to be your own best friend. Your inner voice shapes your reality."
  },
  {
    "id": "9-22",
    "chapter": 9,
    "verse": 22,
    "sanskrit": "अनन्याश्चिन्तयन्तो मां ये जनाः पर्युपासते। तेषां नित्याभियुक्तानां योगक्षेमं वहाम्यहम्॥",
    "english": "To those who worship Me with devotion, meditating on My transcendental form, I provide what they lack and preserve what they have.",
    "tags": ["Faith", "Trust", "Surrender", "Spirituality", "Anxiety"],
    "reflection": "Sometimes you've done all you can. Now it's time to trust. When you've exhausted your efforts, surrender the outcome to something greater than yourself. Let go, and let the universe provide."
  },
  {
    "id": "2-70",
    "chapter": 2,
    "verse": 70,
    "sanskrit": "आपूर्यमाणमचलप्रतिष्ठं समुद्रमापः प्रविशन्ति यद्वत्। तद्वत्कामा यं प्रविशन्ति सर्वे स शान्तिमाप्नोति न कामकामी॥",
    "english": "As waters enter the ocean, which remains still though filled from all sides, one attains peace when desires enter them similarly, not one who craves.",
    "tags": ["Peace", "Contentment", "Desire", "Mindfulness", "Anxiety"],
    "reflection": "Imagine being like the ocean—vast, deep, unmoved by the rivers of desire flowing into you. True peace comes not from getting what you want, but from being complete regardless of what comes."
  },
  {
    "id": "18-66",
    "chapter": 18,
    "verse": 66,
    "sanskrit": "सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज। अहं त्वां सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः॥",
    "english": "Abandon all varieties of dharma and simply surrender unto Me. I shall deliver you from all sinful reactions. Do not fear.",
    "tags": ["Surrender", "Faith", "Liberation", "Fear", "Death", "Spirituality"],
    "reflection": "At life's most overwhelming moments, when rules and duties feel like chains, there's a simpler path: surrender. Release the need to figure everything out. Trust in the divine plan. You are held."
  },
  {
    "id": "2-22",
    "chapter": 2,
    "verse": 22,
    "sanskrit": "वासांसि जीर्णानि यथा विहाय नवानि गृह्णाति नरोऽपराणि। तथा शरीराणि विहाय जीर्णान्यन्यानि संयाति नवानि देही॥",
    "english": "As a person puts on new garments, giving up old ones, the soul similarly accepts new material bodies, giving up old and useless ones.",
    "tags": ["Death", "Change", "Transition", "Loss", "Spirituality", "Grief"],
    "reflection": "Death is not an ending but a transition—like changing clothes. The essence of who we are continues. This perspective doesn't diminish grief, but it offers hope: nothing truly ends."
  },
  {
    "id": "3-35",
    "chapter": 3,
    "verse": 35,
    "sanskrit": "श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात्। स्वधर्मे निधनं श्रेयः परधर्मो भयावहः॥",
    "english": "It is better to perform one's own duty imperfectly than to perform another's duty perfectly. It is better to die in one's own duty; another's duty brings danger.",
    "tags": ["Purpose", "Career", "Identity", "Self-doubt", "Authenticity"],
    "reflection": "Stop comparing your path to others. Your journey is uniquely yours. Even if you stumble on your own path, it's better than walking perfectly on someone else's. Be authentic, even if imperfect."
  },
  {
    "id": "6-35",
    "chapter": 6,
    "verse": 35,
    "sanskrit": "असंशयं महाबाहो मनो दुर्निग्रहं चलम्। अभ्यासेन तु कौन्तेय वैराग्येण च गृह्यते॥",
    "english": "The mind is certainly restless and difficult to control. But it can be restrained through practice and detachment.",
    "tags": ["Mind", "Meditation", "Self-control", "Anxiety", "Mental Health", "Focus"],
    "reflection": "Can't control your thoughts? You're not alone—even Arjuna struggled. The mind is like a wild horse. But with practice and patience, you can train it. Don't give up; mastery takes time."
  }
]

